app/Views/templet/template_frontend.php

SELECT *
FROM `tbl_setting`
WHERE `id` = '1'
SELECT *
FROM `tbl_ta`
WHERE `status` = '1'
---

$db = \config\Database::connect();

$setting = $db->table('tbl_setting')
  ->where('id', '1')
  ->get()->getRowArray();

$ta = $db->table('tbl_ta')
  ->where('status', '1')
  ->get()->getRowArray();