app/Models/ModelAdmin.php

    public function detailSetting()
{
    return $this->db->table('tbl_setting')
       ->where('id', '1')
       ->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`
WHERE `id` = '1'

public function totalJurusan()
{
    return $this->db->table('tbl_jurusan')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_jurusan`

public function totalPekerjaan()
{
    return $this->db->table('tbl_pekerjaan')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_pekerjaan`

public function totalPendidikan()
{
    return $this->db->table('tbl_pendidikan')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_pendidikan`

public function totalAgama()
{
    return $this->db->table('tbl_agama')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_agama`

public function totalPenghasilan()
{
    return $this->db->table('tbl_penghasilan')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_penghasilan`

public function totaluser()
{
    return $this->db->table('tbl_user')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_user`

public function totalPendaftaranMasuk()
{
    return $this->db->table('tbl_siswa')
    ->where('stat_pendaftaran', '1')
    ->where('stat_ppdb', '0')
    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE `stat_pendaftaran` = '1'
AND `stat_ppdb` = '0'

public function totalPendaftaranDiterima()
{
    return $this->db->table('tbl_siswa')
    ->where('stat_ppdb', '1')
    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE `stat_ppdb` = '1'

public function totalPendaftaranDItolak()
{
    return $this->db->table('tbl_siswa')
    ->where('stat_ppdb', '2')
    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE `stat_ppdb` = '2'