app/Models/ModelJurusan.php

    public function getAllData()
{
    return $this->db->table('tbl_jurusan')
        ->orderBy('id_jurusan', 'ASC')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `tbl_jurusan`
ORDER BY `id_jurusan` ASC