app/Models/ModelPpdb.php

SELECT *
FROM `tbl_ta`
ORDER BY `id_ta` ASC
---
    public function getAllDataTa()
    {
        return $this->db->table('tbl_ta')
            ->orderBy('id_ta', 'ASC')
            ->get()
            ->getResultArray();