app/Models/ModelBaner.php

SELECT *
FROM `tbl_baner`
ORDER BY `id_baner` ASC
---
    public function getAllData()
{
    return $this->db->table('tbl_baner')
        ->orderBy('id_baner', 'ASC')
        ->get()
        ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE `tahun` = '2022'
AND `stat_pendaftaran` = '1'
---
public function jumlahPendaftar()
{
    return $this->db->table('tbl_siswa')
    ->where('tahun',date('Y'))
    ->where('stat_pendaftaran', '1')
    ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE `tahun` = '2022'
AND `stat_pendaftaran` = '1'
AND `jenis_kelamin` = 'L'
---
public function jumlahLk()
{
    return $this->db->table('tbl_siswa')
    ->where('tahun',date('Y'))
    ->where('stat_pendaftaran', '1')
    ->where('jenis_kelamin', 'L')
    ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE `tahun` = '2022'
AND `stat_pendaftaran` = '1'
AND `jenis_kelamin` = 'P'
---
public function jumlahpR()
{
    return $this->db->table('tbl_siswa')
    ->where('tahun',date('Y'))
    ->where('stat_pendaftaran', '1')
    ->where('jenis_kelamin', 'P')
    ->countAllResults();